src/mp_toir/Documents/НаработкаОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НаработкаОбъектовЭксплуатации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мп_СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Catalogs/ОбъектыЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мечел_ТехнологическиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаработкаНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/КлассыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиНаработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>мп_ВидыПроверок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроверокОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Documents/НаработкаОбъектовЭксплуатации/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаСтраниц;

&НаКлиенте
Перем ТекущийИндексСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
		Объект.Организация = РеквизитыКонстант["ОрганизацияПользователя"];
		Объект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
		Объект.Ответственный = РеквизитыКонстант["ТекущийПользователь"];
		Объект.мп_СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		
	Иначе
		ТолькоПросмотр = 
			Не ОбщегоНазначенияВызовСервера.РедактированиеФормыДокументаТОиР(
				Объект.Подразделение, Объект.Ответственный, Объект.мп_СтатусОбмена);
			
		ЭтотОбъект.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;

	ЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЧтениеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.НаработкаОбъектовЭксплуатации.Форма.ФормаСтрокиНаработки" Тогда

		ДанныеСтроки = Объект.Наработки.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
			
			Модифицированность = Истина;
			
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора);
			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
			ЧтениеНаСервере();
		ИначеЕсли ДанныеСтроки.ЭтоНоваяСтрока Тогда
			
			НомерСтроки = Объект.Наработки.Количество();
			Объект.Наработки.Удалить(НомерСтроки - 1);
			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИменаСтраниц = Новый Массив;
	ИменаСтраниц.Добавить("Показатели");
	ИменаСтраниц.Добавить("Основная");

	ЭтотОбъект.КоличествоСтраниц = ИменаСтраниц.Количество() - 1;

	ТекущийИндексСтраницы = 0;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ТекущийИндексСтраницы = ИменаСтраниц.Найти(ТекущаяСтраница.Имя);
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаработки

&НаКлиенте
Процедура ИзменитьСтроку(Команда)
	Строка = Элементы.Наработки.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактирования(Строка);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроку(Команда)
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	СтрокаИсходная = Элементы.Наработки.ТекущиеДанные;
	Строка = Объект.Наработки.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;
	ЗаполнитьЗначенияСвойств(Строка, СтрокаИсходная, "ТехнологическоеМесто, ОбъектЭксплуатации, Узел");
	ОткрытьФормуРедактирования(Строка);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = Элементы.Наработки.ТекущиеДанные.НомерСтроки - 1;
	Объект.Наработки.Удалить(ИндексСтроки);

КонецПроцедуры

&НаКлиенте
Процедура НаработкиОбъектЭксплуатацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	//ТехнологическоеМесто = ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ТехнологическоеМесто;
	//МассивЭлементов = Новый Массив;
	//Если ЗначениеЗаполнено(ТехнологическоеМесто) Тогда
	//	
	//	ОбъектыЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(ТехнологическоеМесто);
	//	Если Не ОбъектыЭксплуатации = Неопределено Тогда
	//		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ОбъектыЭксплуатации);
	//		МассивЭлементов.Добавить(НовыйПараметр);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура НаработкиПоказательНаработкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Узел = ЭтотОбъект.ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.Узел;
	МассивЭлементов = Новый Массив;
	Если ЗначениеЗаполнено(Узел) Тогда
		Наработки = НаработкиУзла(Узел);
		Если Не Наработки = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Наработки);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(, "У класса узла нет показателей наработки", 30);
			Возврат;
		КонецЕсли;
	Иначе
			СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
КонецПроцедуры

&НаКлиенте
Процедура НаработкиОбъектЭксплуатацииПриИзменении(Элемент)

	ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ТехнологическоеМесто =
		НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ОбъектЭксплуатации);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодчиненныеЭлементыТехМеста()

	ТекущиеДанные = ЭтотОбъект.Элементы.Наработки.ТекущиеДанные;
	
	ТекущиеДанные.Узел =
		ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");

	ТекущиеДанные.ПоказательНаработки =
		ПредопределенноеЗначение("Справочник.ПоказателиНаработки.ПустаяСсылка");

	ТекущиеДанные.Значение = 0;

КонецПроцедуры

&НаКлиенте
Процедура НаработкиТехнологическоеМестоПриИзменении(Элемент)

	ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ТехнологическоеМесто, Истина);
	
	Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		Если ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ОбъектЭксплуатации <> ОбъектЭксплуатации Тогда
			ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ОбъектЭксплуатации = ОбъектЭксплуатации;
			ОчиститьПодчиненныеЭлементыТехМеста();
		КонецЕсли;
	Иначе
		ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ОбъектЭксплуатации =
			ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
			
		ОчиститьПодчиненныеЭлементыТехМеста();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаработкиУзелНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбъектЭксплуатации = ЭтотОбъект.Элементы.Наработки.ТекущиеДанные.ОбъектЭксплуатации;
	Если Не ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		Возврат;
	КонецЕсли;
	ДоступныеУзлы =
		УзлыПоНаработке(ОбъектЭксплуатации);
		
	Если ДоступныеУзлы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеУзлы);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура НаработкиПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Страница1(Команда)
	НовыйИндекс = Макс(ТекущийИндексСтраницы - 1, 0);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница2(Команда)
	НовыйИндекс = Мин(ТекущийИндексСтраницы + 1, ЭтотОбъект.КоличествоСтраниц);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаработку(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.Наработки.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;
	ОткрытьФормуРедактирования(Строка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуРедактирования(Строка)
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
	ДанныеСтроки.Вставить("ТехнологическоеМесто", Строка.ТехнологическоеМесто);
	ДанныеСтроки.Вставить("ОбъектЭксплуатации", Строка.ОбъектЭксплуатации);
	ДанныеСтроки.Вставить("Узел", Строка.Узел);
	ДанныеСтроки.Вставить("ПоказательНаработки", Строка.ПоказательНаработки);
	ДанныеСтроки.Вставить("Значение", Строка.Значение);
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);

	ОткрытьФорму("Документ.НаработкаОбъектовЭксплуатации.Форма.ФормаСтрокиНаработки",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецПроцедуры
	
&НаСервереБезКонтекста
Функция КаталогиОборудованияПоОбъектуЭксплуатации(Знач Наработки)
	
	ОбъектыЭксплуатации = ОбщегоНазначения.ВыгрузитьКолонку(Наработки, "ОбъектЭксплуатации", Истина);
	
	Если ОбъектыЭксплуатации.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации,
	|	ОбъектыЭксплуатации.ТехнологическоеМесто КАК ТехнологическоеМесто
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|ГДЕ
	|	ОбъектыЭксплуатации.Ссылка В (&ОбъектыЭксплуатации)";
	
	Запрос.УстановитьПараметр("ОбъектыЭксплуатации", ОбъектыЭксплуатации);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

&НаСервере
Процедура ЧтениеНаСервере()

	КаталогиОборудования = КаталогиОборудованияПоОбъектуЭксплуатации(Объект.Наработки);
	
	Если Не КаталогиОборудования = Неопределено Тогда
		
		Для Каждого ТекНаработка Из Объект.Наработки Цикл
			Если ЗначениеЗаполнено(ТекНаработка.ОбъектЭксплуатации) Тогда
				ТекНаработка.ТехнологическоеМесто = 
					КаталогиОборудования.Найти(ТекНаработка.ОбъектЭксплуатации).ТехнологическоеМесто;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НаработкиОбъектЭксплуатацииПриИзмененииНаСервере(Знач ОбъектЭксплуатации)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");

КонецФункции

&НаСервере
Функция НаработкиТехнологическоеМестоПриИзмененииНаСервере(Знач ТехнологическоеМесто)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|ГДЕ
	|	ОбъектыЭксплуатации.ТехнологическоеМесто = &ТехнологическоеМесто";
	
	Запрос.УстановитьПараметр("ТехнологическоеМесто", ТехнологическоеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.ОбъектЭксплуатации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция УзлыПоНаработке(Знач ОбъектЭксплуатации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Ссылка КАК Узел,
	|	УзлыОбъектовЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_Узлы
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Владелец = &ОбъектЭксплуатации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Узлы.Узел КАК Узел
	|ИЗ
	|	вт_Узлы КАК вт_Узлы";
	
	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узел");
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция НаработкиУзла(Знач Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассыОбъектовЭксплуатации.Ссылка КАК Класс
	|ПОМЕСТИТЬ вт_КлассОбъект
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
	|		ПО УзлыОбъектовЭксплуатации.Класс = КлассыОбъектовЭксплуатации.Ссылка
	|			И (&Узел = УзлыОбъектовЭксплуатации.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыОбъектовЭксплуатацииПоказателиНаработки.ПоказательНаработки КАК Наработки
	|ИЗ
	|	вт_КлассОбъект КАК вт_КлассОбъект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассыОбъектовЭксплуатации.ПоказателиНаработки КАК КлассыОбъектовЭксплуатацииПоказателиНаработки
	|		ПО вт_КлассОбъект.Класс = КлассыОбъектовЭксплуатацииПоказателиНаработки.Ссылка";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Наработки");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы)
	ИмяСтраницы = ИменаСтраниц[ТекущийИндексСтраницы];
	Страница = Элементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПредставлениеСтраницы.Заголовок = Страница.Заголовок;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	ЗаголовокГруппыСтраниц = СтрШаблон("Всего: %1 этапа", ЭтотОбъект.КоличествоСтраниц + 1);
	Элементы.ГруппаКнопкиСтраниц.Заголовок = ЗаголовокГруппыСтраниц;
КонецПроцедуры

#КонецОбласти
